InformationRegisters/ХранимыеФайлыВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ХранимыеФайлыВерсий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранимыйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПрисоединенныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПрисоединенныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БытоваяТехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВекторныйФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаОсновная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзрывСхемаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартинкаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КартинкаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышаЛевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КрышаПравая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логотип</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Макет3D</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажнаяСхема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяКартинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемныйФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстураНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФотоЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦеховаяСхема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эскиз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Comment>Владелец файла</Comment>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.Задание</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Comment>Файл зашифрован</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭЦП</Name>
					<Comment>Файл подписан ЭЦП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>Полное наименование (длиной до 256 символов)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Comment>Пользователь, занявший файл для редактирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Comment>Активная версия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияАвтор</Name>
					<Comment>Автор - пользователь, создавший версию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаМодификацииФайла</Name>
					<Comment>Дата модификации файла - в локальном времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаСоздания</Name>
					<Comment>Дата создания версии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияКод</Name>
					<Comment>Текущая версия код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияНомерВерсии</Name>
					<Comment>Номер версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРазмер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширение</Name>
					<Comment>Расширение файла версии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияТом</Name>
					<Comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Comment>Двоичные данные сертификата</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбновлениеФайлов/Ext/Module.bsl
&НаКлиенте
Функция ВыполнитьОбновлениеОбязательныхФайлов() Экспорт
	
	//тз = СоздатьТаблицуЗначений();
	////тз.Индексы.Добавить("Имя");
	//
	//тз = Новый ТаблицаЗначений;
	//тз.Колонки.Добавить();
	
	//"required"
	
	// Для всех: флэшк, хтмл
	// Своим: все логотипы, и подразделений и дилеров
	// Дилерам: только свой логотип
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлы()
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция СоздатьТаблицуЗначений()
	
	ВидыФайлов = Новый Массив;
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ТекстураНоменклатуры);
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.ОсновнаяКартинка);
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КартинкаЛевая);
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КартинкаПравая);
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КрышаЛевая);
	ВидыФайлов.Добавить(Перечисления.ВидыПрисоединенныхФайлов.КрышаПравая);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Имя");
	
	Возврат Таблица;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуИзКаталога(фнТаблица, ИмяФайла) Экспорт
	
	РабочийКаталог = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
	СоздатьКаталогНаДиске(РабочийКаталог);
	
	Попытка
		
		ФайлДБФ = Новый XBase(РабочийКаталог + ИмяФайла + ".dbf", ИмяФайла + ".cdx");
		
		Если НЕ ФайлДБФ.Открыта() Тогда
			
			СоздатьФайлДБФ(ФайлДБФ, РабочийКаталог, ИмяФайла);
			
		КонецЕсли;
		
	Исключение
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Ошибка при открытии файла ""%1"":%2""%3"".'",
		ФайлДБФ,
		Символы.ПС,
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
	ФайлДБФ.Первая();
	Пока НЕ ФайлДБФ.ВКонце() Цикл
		
		НоваяСтрока = фнТаблица.Добавить();
		НоваяСтрока.Имя = СокрЛП(ФайлДБФ.NAME);
		НоваяСтрока.ХэшКаталога = ФайлДБФ.SUM;
		
		ФайлДБФ.Следующая();
		
	КонецЦикла;
	
	ФайлДБФ.ЗакрытьФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКаталогНаДиске(фнКаталог) Экспорт
	
	КаталогНаДиске = Новый Файл(фнКаталог);
	Если НЕ КаталогНаДиске.Существует() Тогда
		
		Попытка
			СоздатьКаталог(фнКаталог);
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Ошибка при создании каталога ""%1"":%2""%3"".'",
			фнКаталог,
			Символы.ПС,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьФайлДБФ(ФайлДБФ, фнКаталог, ИмяФайла) Экспорт
	
	ФайлДБФ.Поля.Добавить("NAME", "S", 100);
	ФайлДБФ.Поля.Добавить("SUM", "N", 15);
	ФайлДБФ.индексы.Добавить("NAME", "NAME", Истина);
	
	ФайлДБФ.СоздатьФайл(фнКаталог + ИмяФайла +".dbf", ИмяФайла +".cdx");
	// Сделать.
	// Создать индекс и использовать для поиска.
	// А то примитивный перебор сейчас. :(
	//ФайлДБФ.СоздатьИндексныйФайл("hash.cdx");
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуИзБазы(фнТаблица, ВидыФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыФайлов", ВидыФайлов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.ВидФайла КАК ВидФайла,
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.ТекущаяВерсия КАК ВерсияФайла,
	|	Файлы.ТекущаяВерсияРазмер / 1024 КАК Размер,
	|	ХранимыеФайлыВерсий.Хэш КАК ХэшБазы
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|		ПО Файлы.ТекущаяВерсия = ХранимыеФайлыВерсий.ВерсияФайла
	|ГДЕ
	|	НЕ Файлы.ПометкаУдаления
	|	И Файлы.ВидФайла В(&ВидыФайлов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Имя = ЛексСервер.ПолучитьИмяПрисоединенногоФайла(Выборка.ВидФайла, Выборка.ВладелецФайла);
		
		НайденныеСтроки = фнТаблица.НайтиСтроки(Новый Структура("Имя", Имя));
		КоличествоСтрок = НайденныеСтроки.Количество();
		Если КоличествоСтрок = 1 Тогда
			
			Строка = НайденныеСтроки[0];
			
			Если Выборка.ХэшБазы = Строка.ХэшКаталога Тогда
				фнТаблица.Удалить(Строка);
			Иначе
				Строка.ХэшБазы = Выборка.ХэшБазы;
				Строка.ВладелецФайла = Выборка.ВладелецФайла;
				Строка.ВерсияФайла = Выборка.ВерсияФайла;
				Строка.Размер = Выборка.Размер;
			КонецЕсли;
			
		ИначеЕсли КоличествоСтрок = 0 Тогда
			
			Строка = фнТаблица.Добавить();
			Строка.Имя = Имя;
			Строка.ХэшБазы = Выборка.ХэшБазы;
			Строка.ВладелецФайла = Выборка.ВладелецФайла;
			Строка.ВерсияФайла = Выборка.ВерсияФайла;
			Строка.Размер = Выборка.Размер;
			
		Иначе
			
			// Ошибка, несколько файлов с одинаковым именем.
			// Обработать, внести инфу в журнал регистрации, сообщить админам.
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуОбязательныхФайлов(фнТаблица) Экспорт
	
	ПапкиФайлов = Новый Массив;
	ПапкиФайлов.Добавить(Справочники.ПапкиФайлов.Flash);
	ПапкиФайлов.Добавить(Справочники.ПапкиФайлов.Html);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПапкиФайлов", ПапкиФайлов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.ВидФайла КАК ВидФайла,
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.ТекущаяВерсия КАК ВерсияФайла,
	|	Файлы.ТекущаяВерсияРазмер / 1024 КАК Размер,
	|	ХранимыеФайлыВерсий.Хэш КАК ХэшБазы
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ХранимыеФайлыВерсий КАК ХранимыеФайлыВерсий
	|		ПО Файлы.ТекущаяВерсия = ХранимыеФайлыВерсий.ВерсияФайла
	|ГДЕ
	|	НЕ Файлы.ПометкаУдаления
	|	И Файлы.ВладелецФайла В(&ПапкиФайлов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.ВладелецФайла) = Тип("СправочникСсылка.ПапкиФайлов") Тогда
			Имя = Выборка.ВерсияФайла.ПолноеНаименование + "." + Выборка.ВерсияФайла.Расширение;
		Иначе
			Имя = ЛексСервер.ПолучитьИмяПрисоединенногоФайла(Выборка.ВидФайла, Выборка.ВладелецФайла);
		КонецЕсли;
		
		НайденныеСтроки = фнТаблица.НайтиСтроки(Новый Структура("Имя", Имя));
		КоличествоСтрок = НайденныеСтроки.Количество();
		Если КоличествоСтрок = 1 Тогда
			
			Строка = НайденныеСтроки[0];
			
			Если Выборка.ХэшБазы = Строка.ХэшКаталога Тогда
				фнТаблица.Удалить(Строка);
			Иначе
				Строка.ХэшБазы = Выборка.ХэшБазы;
				Строка.ВладелецФайла = Выборка.ВладелецФайла;
				Строка.ВерсияФайла = Выборка.ВерсияФайла;
				Строка.Размер = Выборка.Размер;
			КонецЕсли;
			
		ИначеЕсли КоличествоСтрок = 0 Тогда
			
			Строка = фнТаблица.Добавить();
			Строка.Имя = Имя;
			Строка.ХэшБазы = Выборка.ХэшБазы;
			Строка.ВладелецФайла = Выборка.ВладелецФайла;
			Строка.ВерсияФайла = Выборка.ВерсияФайла;
			Строка.Размер = Выборка.Размер;
			
		Иначе
			
			// Ошибка, несколько файлов с одинаковым именем.
			// Обработать, внести инфу в журнал регистрации, сообщить админам.
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции
